       IDENTIFICATION DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY "C:\USERS\BPIHOU~1\DESKTOP\080920~1\BANKING\CUSTMENU.wks".
       SCREEN SECTION.
       COPY "C:\USERS\BPIHOU~1\DESKTOP\080920~1\BANKING\CUSTMENU.ss".
       PROCEDURE DIVISION.
           DISPLAY G-CUSTMENU.
           ACCEPT G-CUSTMENU.
           STOP RUN.
